// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.

let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
friends.length >= 3 ? console.log('великий масив') : console.log('маленький масив');

// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.

let num1 = 1;
let num2 = 2;
let num3 = 3;

if (num1 > num2 && num1 < num3) {
    console.log('перше число знаходиться між двома іншими');
}
if (num2 > num1 && num2 < num3) {
    console.log('друге число знаходиться між двома іншими');
}
if (num3 > num1 && num3 < num2) {
    console.log('третє число знаходиться між двома іншими');
}


// - Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }

let a = 1;
let b = 2;
(a + b < 4) ? console.log('Мало') : console.log('Багато');

// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором

let number = 2;
if (number === 0) {
    console.log('0')
} else {
    number < 0 ? console.log('негативне') : console.log('позитивне')
}

// - У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)

const test = true;
test === true ? console.log('Вірно') : console.log('Неправильно');

// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!

if (prompt('Яка «офіційна» назва JavaScript?') === 'ECMAScript') {
    console.log('Правильно!')
} else {
    console.log('Не знаєте? ECMAScript!')
}

//     - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

const room = 25;

if (room >= 1 && room <= 20) {
    console.log("перший під'їзд");
} else if (room >= 21 && room <= 48) {
    console.log("другий під'їзд");
} else if (room >= 49 && room <= 90) {
    console.log("третій під'їзд");
} else {
    console.log('щос не то натицав')
}

// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО

const number1 = +prompt('введіть число');
number === 10 ? console.log('ВІРНО') : console.log('НЕВІРНО');

// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН

const temperature = +prompt('введіть темрературу за вікном');
if (temperature >= 10 && temperature <= 22) {
    console.log('йдемо ВЧИТИСЯ');
} else if (temperature < 10 || temperature > 22) {

    console.log('сидимо вдома і вчимося ОНЛАЙН');
} else {
    console.log('щос не то натицав');
}


// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .

const playerNumber = +prompt('введіть число від 1 до 5 та отримайте приз');
switch (playerNumber) {
    case 1:
        console.log('вітаю ти виграв Авто');
        break
    case 2:
        console.log('вітаю ти виграв Мотоцикл');
        break
    case 3:
        console.log('вітаю ти виграв Телефон');
        break
    case 4:
        console.log('вітаю ти виграв Квартиру');
        break
    case 5:
        console.log('вітаю ти виграв Мандрывку до Іспанії');
        break
    default:
        console.log('число не вірне ... .');
}